In [1]:
import pandas as pd

In [2]:
df = pd.Series([1,2,3], index=['a','b','c'])

In [3]:
df

a    1
b    2
c    3
dtype: int64

In [4]:
df.values

array([1, 2, 3])

In [5]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [6]:
df.shape

(3,)

In [7]:
df['a']

1

In [8]:
2 in df

False

In [9]:
df1 = pd.Series(list('abcde'*4))

In [10]:
df1

0     a
1     b
2     c
3     d
4     e
5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [11]:
df1.unique()

array(['a', 'b', 'c', 'd', 'e'], dtype=object)

In [12]:
df1.nunique()

5

In [13]:
df1.count()

20

In [14]:
df1.value_counts()

d    4
e    4
a    4
c    4
b    4
dtype: int64

In [15]:
df1.sort_values()

0     a
5     a
10    a
15    a
1     b
6     b
11    b
16    b
2     c
17    c
7     c
12    c
3     d
8     d
18    d
13    d
9     e
4     e
14    e
19    e
dtype: object

In [16]:
df1.sort_index()

0     a
1     b
2     c
3     d
4     e
5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [17]:
df.idxmax()

'c'

In [18]:
df.idxmin()

'a'

In [19]:
df.nlargest()

c    3
b    2
a    1
dtype: int64

In [20]:
df.nsmallest()

a    1
b    2
c    3
dtype: int64

In [21]:
import numpy as np
a = pd.Series([2,36,np.nan,34,56])

In [22]:
a.isna()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [23]:
a.fillna(a.mean())

0     2.0
1    36.0
2    32.0
3    34.0
4    56.0
dtype: float64

In [24]:
a.mean()

32.0

In [25]:
a

0     2.0
1    36.0
2     NaN
3    34.0
4    56.0
dtype: float64

In [26]:
a.dropna()

0     2.0
1    36.0
3    34.0
4    56.0
dtype: float64

In [27]:
a.sort_values()

0     2.0
3    34.0
1    36.0
4    56.0
2     NaN
dtype: float64

In [28]:
a.ffill()

0     2.0
1    36.0
2    36.0
3    34.0
4    56.0
dtype: float64

In [29]:
a.bfill()

0     2.0
1    36.0
2    34.0
3    34.0
4    56.0
dtype: float64

In [30]:
a.median()

35.0

In [31]:
import pandas as pd
import numpy  as np

In [32]:
df = pd.DataFrame(data= [[2,3,4,5],[2,6,7,8],[4,5,6,7]], columns=['a','b','c','d'],index= ['i1','i2','i3'] )

In [33]:
df

    a  b  c  d
i1  2  3  4  5
i2  2  6  7  8
i3  4  5  6  7

In [34]:
df['e'] = [3,7,0]

In [35]:
df

    a  b  c  d  e
i1  2  3  4  5  3
i2  2  6  7  8  7
i3  4  5  6  7  0

In [36]:
df.loc['i4'] = [2,3,4,5,6]

In [37]:
df

    a  b  c  d  e
i1  2  3  4  5  3
i2  2  6  7  8  7
i3  4  5  6  7  0
i4  2  3  4  5  6

In [38]:
f = df.b

In [39]:
f

i1    3
i2    6
i3    5
i4    3
Name: b, dtype: int64

In [40]:
df['b']

i1    3
i2    6
i3    5
i4    3
Name: b, dtype: int64

In [41]:
df.loc[:,'a':'e']

    a  b  c  d  e
i1  2  3  4  5  3
i2  2  6  7  8  7
i3  4  5  6  7  0
i4  2  3  4  5  6

In [42]:
df.iloc[:,1:4]

    b  c  d
i1  3  4  5
i2  6  7  8
i3  5  6  7
i4  3  4  5

In [43]:
df.loc[:,['b','e']]

    b  e
i1  3  3
i2  6  7
i3  5  0
i4  3  6

In [44]:
#index with loc and iloc [row,col]
#change can be done with normal way

In [45]:
df['e'][2]

0

In [46]:
df1 = list(map(lambda num: num+2, df.a))

In [47]:
df1

[4, 4, 6, 4]

In [48]:
df['a'] = df1

In [49]:
df

    a  b  c  d  e
i1  4  3  4  5  3
i2  4  6  7  8  7
i3  6  5  6  7  0
i4  4  3  4  5  6

In [50]:
df = pd.DataFrame(data= [[2,3,4,5],[2,np.nan,np.nan,8],[4,5,np.nan,7]], columns=['a','b','c','d'],index= ['i1','i2','i3'] )

In [51]:
df

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [52]:
df.isna()

        a      b      c      d
i1  False  False  False  False
i2  False   True   True  False
i3  False  False   True  False

In [53]:
df.isna().sum()

a    0
b    1
c    2
d    0
dtype: int64

In [54]:
df['b'][1]

nan

In [55]:
df

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [56]:
df.fillna(3)

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  3.0  3.0  8
i3  4  5.0  3.0  7

In [57]:
df

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [58]:
df.dropna()

    a    b    c  d
i1  2  3.0  4.0  5

In [59]:
df.dropna(axis=1)   #axis=0 is for rows and 1 for cols

    a  d
i1  2  5
i2  2  8
i3  4  7

In [60]:
df.dropna(axis=0,how='all')

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [61]:
df_new = pd.DataFrame({'start_year':[2001,2001,2005,2005,2006],
                      'end_year':[2002,2010,2008,2006,2014]})
df_new

   start_year  end_year
0        2001      2002
1        2001      2010
2        2005      2008
3        2005      2006
4        2006      2014

In [62]:
df_new

   start_year  end_year
0        2001      2002
1        2001      2010
2        2005      2008
3        2005      2006
4        2006      2014

In [63]:
def stda(x):
    std = (x.max() - x.min())
    return std
df_new.apply(stda, axis=0)

start_year     5
end_year      12
dtype: int64

In [64]:
stda(df_new)

start_year     5
end_year      12
dtype: int64

In [65]:
df_new

   start_year  end_year
0        2001      2002
1        2001      2010
2        2005      2008
3        2005      2006
4        2006      2014

In [66]:
# map(), apply() and applymap()

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, i1 to i3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       2 non-null      float64
 2   c       1 non-null      float64
 3   d       3 non-null      int64
dtypes: float64(2), int64(2)
memory usage: 120.0+ bytes

In [68]:
df.shape

(3, 4)

In [69]:
df_new.shape

(5, 2)

In [70]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   start_year  5 non-null      int64
 1   end_year    5 non-null      int64
dtypes: int64(2)
memory usage: 208.0 bytes

In [71]:
df

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [72]:
df.drop(['a'], axis= 1
       )

      b    c  d
i1  3.0  4.0  5
i2  NaN  NaN  8
i3  5.0  NaN  7

In [73]:
df

    a    b    c  d
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [74]:
df['r'] = ['','','']

In [75]:
df

    a    b    c  d r
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [76]:
df = df.assign(E = '')

In [77]:
df

    a    b    c  d r E
i1  2  3.0  4.0  5
i2  2  NaN  NaN  8
i3  4  5.0  NaN  7

In [78]:
df.loc['1'] = ''

In [79]:
df

    a    b    c  d r E
i1  2    3    4  5
i2  2  NaN  NaN  8
i3  4    5  NaN  7
1

In [80]:
df.loc['3'] = 'new'

In [81]:
df

      a    b    c    d    r    E
i1    2    3    4    5
i2    2  NaN  NaN    8
i3    4    5  NaN    7
1
3   new  new  new  new  new  new

In [82]:
df.replace(to_replace='new',value=34)

     a    b    c   d   r   E
i1   2    3    4   5
i2   2  NaN  NaN   8
i3   4    5  NaN   7
1
3   34   34   34  34  34  34

In [83]:
df['t']= '3'